# ![](https://ga-dash.s3.amazonaws.com/production/assets/logo-9f88ae6c9c3871690e33280fcf557f33.png) Intro to Pandas 1
Week 1 | Day 5

### LEARNING OBJECTIVES
*After this lesson, you will be able to:*
- Read a csv file using pandas
- Viewing data: head, columns, values, describe
- Selection: a single column, slicing by row, by position
- Perform boolean indexing on dataframes
- Perform math functions using pandas.Series functions
- Inspect data types
- Clean up a column using df.apply()
- Know what situations to use .value_counts() in your code

<a name="Pandas"></a>
## Introduction: Topic (5 mins)

Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data
structures and data analysis tools for the Python programming language.

[pandas](http://pandas.pydata.org/)

In [28]:
numbersNP = np.array([23, 19, 17.5, 20])
numbersLst = [23, 19, 17, 20]

print(type(numbersNP))
print(type(numbersLst))

<class 'numpy.ndarray'>
<class 'list'>

In [29]:
numbersNP + 5

array([28. , 24. , 22.5, 25. ])


<a name="Read csv"></a>
## Demo / Guided Practice: Topic (10 mins)

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [30]:
# read in csv file and create a pandas dataframe
df = pd.read_csv("sales.csv")
df

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won
5,218895,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000,pending
6,218895,Kulas Inc,Daniel Hilton,Debra Henley,Software,1,10000,presented
7,412290,Jerde-Hilpert,John Smith,Debra Henley,Maintenance,2,5000,pending
8,740150,Barton LLC,John Smith,Debra Henley,CPU,1,35000,declined
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
10,163416,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000,presented
11,239344,Stokes LLC,Cedric Moss,Fred Anderson,Maintenance,1,5000,pending
12,239344,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000,presented
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
15,729833,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000,declined
16,729833,Koepp Ltd,Wendy Yule,Fred Anderson,Monitor,2,5000,presented

**Check:** This looks familiar...didn't we already learn how to read in csv files?
Yes, but that was using Python without any libraries or packages. It took 5 lines of
Python, but using Pandas it only takes one line. Nice!

<a name="Viewing data: head/tail, describe"></a>
## Demo / Guided Practice: Viewing data: head/tail, describe (25 mins)

In [32]:
# head of dataset
df.head(7)

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won
5,218895,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000,pending
6,218895,Kulas Inc,Daniel Hilton,Debra Henley,Software,1,10000,presented

In [33]:
# tail of dataset

df.tail()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
12,239344,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000,presented
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
15,729833,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000,declined
16,729833,Koepp Ltd,Wendy Yule,Fred Anderson,Monitor,2,5000,presented

In [37]:
# random rows

df.sample(5)

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
5,218895,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000,pending
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
6,218895,Kulas Inc,Daniel Hilton,Debra Henley,Software,1,10000,presented
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending

**Check:** What can looking at the head and tail of a dataset tell us?

In [40]:
# summary stats

df.describe(include="all")

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
count,17.000000,17,17,17,17,17.000000,17.000000,17
unique,NaN,12,5,2,4,NaN,NaN,4
top,NaN,Trantow-Barrows,Craig Booker,Debra Henley,CPU,NaN,NaN,presented
freq,NaN,3,4,9,9,NaN,NaN,6
mean,462254.235294,NaN,NaN,NaN,NaN,1.764706,30705.882353,NaN
std,259093.442862,NaN,NaN,NaN,NaN,1.032558,28444.605609,NaN
min,141962.000000,NaN,NaN,NaN,NaN,1.000000,5000.000000,NaN
25%,218895.000000,NaN,NaN,NaN,NaN,1.000000,7000.000000,NaN
50%,412290.000000,NaN,NaN,NaN,NaN,2.000000,30000.000000,NaN
75%,714466.000000,NaN,NaN,NaN,NaN,2.000000,40000.000000,NaN
max,740150.000000,NaN,NaN,NaN,NaN,5.000000,100000.000000,NaN

This gives us: count, mean, std, min, 25%, 50%, 75%, and max. Awesome!

**Check:** What was the cautionary tale about relying too heavily on summary stats again?


<a name="Selection: a single column, slicing by row, by position"></a>
## Demo / Guided Practice: Selection: a single column, slicing by row, by position (25 mins)

In [46]:
# select a single column

# df["Manager"]
# df.Manager

df[["Name", "Quantity", "Price"]]

                            Name  Quantity   Price
0                Trantow-Barrows         1   30000
1                Trantow-Barrows         1   10000
2                Trantow-Barrows         2    5000
3   Fritsch, Russel and Anderson         1   35000
4                   Kiehn-Spinka         2   65000
5                      Kulas Inc         2   40000
6                      Kulas Inc         1   10000
7                  Jerde-Hilpert         2    5000
8                     Barton LLC         1   35000
9                     Herman LLC         2   65000
10                   Purdy-Kunde         1   30000
11                    Stokes LLC         1    5000
12                    Stokes LLC         1   10000
13   Kassulke, Ondricka and Metz         3    7000
14                   Keeling LLC         5  100000
15                     Koepp Ltd         2   65000
16                     Koepp Ltd         2    5000

**Check:** How would you select the 'Quantity' and 'Price' columns separately?

In [50]:
# slice certain rows 
df[0:5]

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

**Check:** How would you slice for rows 9 to 14?

In [51]:
# slice for rows 9-14
df[9:15]

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
10,163416,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000,presented
11,239344,Stokes LLC,Cedric Moss,Fred Anderson,Maintenance,1,5000,pending
12,239344,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000,presented
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won

##### Now, let's try selecting by position.

In [52]:
# First, let's slice some rows.
df.iloc[0:3, 0:3]

   Account             Name           Rep
0   714466  Trantow-Barrows  Craig Booker
1   714466  Trantow-Barrows  Craig Booker
2   714466  Trantow-Barrows  Craig Booker

**Check:** How would you slice for rows 9 to 14?

In [53]:
df.iloc[9:15, :]

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
10,163416,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000,presented
11,239344,Stokes LLC,Cedric Moss,Fred Anderson,Maintenance,1,5000,pending
12,239344,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000,presented
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won

In [59]:
# slice some columns
# df.iloc[:, 4:7]
df.iloc[:, [1, 5, 6]]

                            Name  Quantity   Price
0                Trantow-Barrows         1   30000
1                Trantow-Barrows         1   10000
2                Trantow-Barrows         2    5000
3   Fritsch, Russel and Anderson         1   35000
4                   Kiehn-Spinka         2   65000
5                      Kulas Inc         2   40000
6                      Kulas Inc         1   10000
7                  Jerde-Hilpert         2    5000
8                     Barton LLC         1   35000
9                     Herman LLC         2   65000
10                   Purdy-Kunde         1   30000
11                    Stokes LLC         1    5000
12                    Stokes LLC         1   10000
13   Kassulke, Ondricka and Metz         3    7000
14                   Keeling LLC         5  100000
15                     Koepp Ltd         2   65000
16                     Koepp Ltd         2    5000

**Check:** How would you slice for the 'Manager' and 'Product' columns?

In [60]:
# slice for the 'manager' column
df.iloc[:, 3]

0      Debra Henley
1      Debra Henley
2      Debra Henley
3      Debra Henley
4      Debra Henley
5      Debra Henley
6      Debra Henley
7      Debra Henley
8      Debra Henley
9     Fred Anderson
10    Fred Anderson
11    Fred Anderson
12    Fred Anderson
13    Fred Anderson
14    Fred Anderson
15    Fred Anderson
16    Fred Anderson
Name: Manager, dtype: object

In [63]:
df.loc[9:15, "Manager"]

9     Fred Anderson
10    Fred Anderson
11    Fred Anderson
12    Fred Anderson
13    Fred Anderson
14    Fred Anderson
15    Fred Anderson
Name: Manager, dtype: object

In [64]:
df.loc[9:15, "Manager": "Price"]

          Manager      Product  Quantity   Price
9   Fred Anderson          CPU         2   65000
10  Fred Anderson          CPU         1   30000
11  Fred Anderson  Maintenance         1    5000
12  Fred Anderson     Software         1   10000
13  Fred Anderson  Maintenance         3    7000
14  Fred Anderson          CPU         5  100000
15  Fred Anderson          CPU         2   65000

In [65]:
# select for an explicit value only

df.iloc[0, 3]

'Debra Henley'

In [66]:
# create a dataframe

data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'age': [42, 52, 36, 24, 73], 
        'preTestScore': [4, 24, 31, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70]}

df = pd.DataFrame(data, columns = ['name', 'age', 'preTestScore', 'postTestScore'])
df

    name  age  preTestScore  postTestScore
0  Jason   42             4             25
1  Molly   52            24             94
2   Tina   36            31             57
3   Jake   24             2             62
4    Amy   73             3             70

In [70]:
# find the sum of all the ages using pandas
df["age"].sum()

227

In [72]:
# find the sum of all the ages using numpy
np.sum(df["age"])

227

In [73]:
# find the mean preTestScore using pandas
df["preTestScore"].mean()

12.8

In [74]:
# find the mean preTestScore using numpy
np.mean(df["preTestScore"])

12.8

In [76]:
# find the min value of preTestScore using pandas

df["preTestScore"].min()

2

In [75]:
# find the min value of preTestScore using numpy
np.min(df["preTestScore"])

2

In [78]:
# find the max value of preTestScore using pandas
df["preTestScore"].max()

31

In [77]:
# find the max value of preTestScore using numpy
np.max(df["preTestScore"])

31

In [80]:
# find the median value of preTestScore using pandas
df["preTestScore"].median()

4.0

In [79]:
# find the median value of preTestScore using numpy
np.median(df["preTestScore"])

4.0

<a name="Series and DataFrame data types"></a>
## Introduction: Series and DataFrame data types (10 mins)

- Series is a one-dimensional labeled array capable of holding any data type (integers, strings,
floating point numbers, Python objects, etc.). The axis labels are collectively referred to as
the index. The basic method to create a Series is to call:

```Python
s = pd.Series(data, index=index)
```

- Here, data can be many different things:
    - a Python dict
    - an ndarray
    - a scalar value (like 5)

- The passed index is a list of axis labels.



- DataFrame is a 2-dimensional labeled data structure with columns of potentially
different types. You can think of it like a spreadsheet or SQL table, or a dict
of Series objects. It is generally the most commonly used pandas object.

- Like Series, DataFrame accepts many different kinds of input:
    - Dict of 1D ndarrays, lists, dicts, or Series
    - 2-D numpy.ndarray
    - Structured or record ndarray
    - A Series
    - Another DataFrame

- Along with the data, you can optionally pass index (row labels) and columns
(column labels) arguments. If you pass an index and / or columns, you are
guaranteeing the index and / or columns of the resulting DataFrame. Thus, a dict
of Series plus a specific index will discard all data not matching up to the
passed index.

- If axis labels are not passed, they will be constructed from the input data based on common sense rules.

Here is more information on [series and dataframes](http://pandas.pydata.org/pandas-docs/stable/dsintro.html).

**Check:** What are some differences between Series and DataFrame?

<a name="pd.Series"></a>
## Demo / Guided Practice: pd.Series (25 mins)

Let's create a series and see what `pandas.Series` can do.

In [86]:
# np.random.randn(5, 5)
# np.random.randint(5, 25, (2, 5))

array([[ 7, 14, 19, 19, 20],
       [21, 11, 18,  6, 19]])

In [88]:
# create a series using a numpy random number generator

s = pd.Series(np.random.randint(5, 25, 7), index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])  
s

a    17
b     8
c     7
d    20
e     9
f    24
g    16
dtype: int32


Now we have a series of 7 random numbers. Let's try out the same things we did with
a data frame back in W2 L1.1. First, let's look at the series head.

In [94]:
# head of series

# s.head()
pd.Series.head(s)

a    17
b     8
c     7
d    20
e     9
dtype: int32

In [93]:
# tail of series
s.tail()

c     7
d    20
e     9
f    24
g    16
dtype: int32

In [95]:
# summary stats
s.describe()

count     7.000000
mean     14.428571
std       6.553807
min       7.000000
25%       8.500000
50%      16.000000
75%      18.500000
max      24.000000
dtype: float64

In [99]:
# select by location c to g
# s.loc['c': 'g']
# s.iloc[2:]
s['c': 'g']

c     7
d    20
e     9
f    24
g    16
dtype: int32

In [100]:
# select just b
s['b']

8

In [102]:
# slice for rows 1-3
s.iloc[1: 4]

b     8
c     7
d    20
dtype: int32

**Check:** How would you select just 'd'?

<a name="Boolean indexing"></a>
## Demo / Guided Practice: Boolean indexing (25 mins)

Another common operation is the use of boolean vectors to filter the data. The operators
are: | for or, & for and, and ~ for not. These must be grouped by using parentheses.

Let's create another series and use pandas to do some Boolean indexing.

In [103]:
# create another series ranging from -3 to 3
s = pd.Series(range(-3, 4))
s

0   -3
1   -2
2   -1
3    0
4    1
5    2
6    3
dtype: int64

In [105]:
# find the values that are > 0. 

s[s > 0]

4    1
5    2
6    3
dtype: int64

In [107]:
# find the values that are < -1 or > 0.5

s[(s < -1) | (s > 0.5)]

0   -3
1   -2
4    1
5    2
6    3
dtype: int64

In [108]:
# find the values that are not < 0.

s[~(s < 0)]

3    0
4    1
5    2
6    3
dtype: int64

Here is some further information on [boolean indexing](http://pandas.pydata.org/pandas-docs/stable/indexing.html#slicing-ranges).

**Check:** How would you find all the numbers that are < 2?

In [109]:
# find the values that are < 2
s[s < 2]

0   -3
1   -2
2   -1
3    0
4    1
dtype: int64

<a name="ind-practice"></a>
## Independent Practice: (25 minutes)
- Create a series
- Look at the head, tail, and summary stats
- Select certain values by location
- Slice for certain rows
- Using Boolean indexing find values that are < than another value
- Using Boolean indexing find values that are > than another value
- Using Boolean indexing find values that are < than another value and > another value

<a name="introduction"></a>
## Introduction: Topic (5 mins)

Since we're starting to get pretty comfortable with using pandas to do EDA, let's add a
couple more tools to our toolbox.

The main data types stored in pandas objects are float, int, bool, datetime64, datetime64, timedelta,
category, and object.

df.apply() will apply a function along any axis of the DataFrame. We'll see it in action below.

pandas.Series.value_counts returns Series containing counts of unique values. The resulting
Series will be in descending order so that the first element is the most frequently-occurring
element. Excludes NA values.

- Examples of [dtypes](http://pandas.pydata.org/pandas-docs/stable/pandas.pdf).
- Examples of [value_counts](http://nullege.com/codes/search/pandas.Series.value_counts).

<a name="Inspect data types "></a>
## Demo /Guided Practice: Inspect data types  (20 mins)

Let's create a small dictionary with different data types in it.

In [110]:
import pandas as pd
import numpy as np
dft = pd.DataFrame(dict(A = np.random.rand(3),
                        B = 1,
                        C = 'foo',
                        D = pd.Timestamp('20010102'),
                        E = pd.Series([1.0]*3).astype('float32'),
                                F = False,
                                G = pd.Series([1]*3,dtype='int8')))
dft

          A  B    C          D    E      F  G
0  0.972653  1  foo 2001-01-02  1.0  False  1
1  0.191399  1  foo 2001-01-02  1.0  False  1
2  0.759903  1  foo 2001-01-02  1.0  False  1

There is a really easy way to see what kind of dtypes are in each column.

In [111]:
dft.dtypes

A           float64
B             int64
C            object
D    datetime64[ns]
E           float32
F              bool
G              int8
dtype: object

If a pandas object contains data multiple dtypes IN A SINGLE COLUMN, the dtype of the
column will be chosen to accommodate all of the data types (object is the most general).

In [118]:
# these ints are coerced to floats
pd.Series([1, 2, 3, 4, 5, 6.])

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

In [119]:
# string data forces an ``object`` dtype
pd.Series([1, 2, 3, 6., 'foo'])

0      1
1      2
2      3
3      6
4    foo
dtype: object

The method `DataFrame.dtypes.value_counts()` will return the number of columns of each type in a DataFrame:

In [122]:

dft.dtypes.value_counts()

int64             1
bool              1
object            1
float32           1
float64           1
datetime64[ns]    1
int8              1
dtype: int64

You can do a lot more with dtypes that you can check out [here](http://pandas.pydata.org/pandas-docs/stable/pandas.pdf).

**Check:** Why do you think it might be important to know what kind of dtypes you're working with?

<a name=" df.apply()"></a>
## Demo /Guided Practice:  df.apply() (20 mins)

Let's create a small data frame.

In [128]:
df = pd.DataFrame(np.random.randint(1, 10, (5, 4)), columns=['a', 'b', 'c', 'd'])
df

   a  b  c  d
0  6  1  1  2
1  6  2  8  2
2  7  3  6  3
3  1  8  8  3
4  2  3  5  1

Use `df.apply` to find the square root of all the values.

In [129]:
df.apply(np.sqrt)

          a         b         c         d
0  2.449490  1.000000  1.000000  1.414214
1  2.449490  1.414214  2.828427  1.414214
2  2.645751  1.732051  2.449490  1.732051
3  1.000000  2.828427  2.828427  1.732051
4  1.414214  1.732051  2.236068  1.000000

Find the mean of all of the columns.

In [134]:
df.apply(np.mean, axis=0)

a    4.4
b    3.4
c    5.6
d    2.2
dtype: float64

Find the mean of all of the rows.

In [133]:
df.apply(np.mean, axis=1)

0    2.50
1    4.50
2    4.75
3    5.00
4    2.75
dtype: float64

[df.apply](https://gist.github.com/why-not/4582705)
[df.apply](http://chrisalbon.com/python/pandas_apply_operations_to_dataframes.html)

**Check:** How would find the std of the columns and rows?

<a name=".value_counts()"></a>
## Demo /Guided Practice: .value_counts() (20 mins)

Let's create a random array with 50 numbers, ranging from 0 to 7.

In [135]:
data = np.random.randint(0, 7, size = 50)
data

array([5, 0, 1, 3, 6, 1, 0, 0, 6, 4, 3, 4, 4, 6, 6, 4, 3, 6, 2, 4, 2, 2,
       2, 0, 5, 0, 6, 5, 5, 1, 4, 5, 3, 1, 1, 0, 0, 5, 6, 0, 0, 1, 1, 0,
       2, 3, 6, 1, 2, 6])

Convert the array into a series.

In [136]:
s = pd.Series(data)
s

0     5
1     0
2     1
3     3
4     6
5     1
6     0
7     0
8     6
9     4
10    3
11    4
12    4
13    6
14    6
15    4
16    3
17    6
18    2
19    4
20    2
21    2
22    2
23    0
24    5
25    0
26    6
27    5
28    5
29    1
30    4
31    5
32    3
33    1
34    1
35    0
36    0
37    5
38    6
39    0
40    0
41    1
42    1
43    0
44    2
45    3
46    6
47    1
48    2
49    6
dtype: int32

How many of each number is there in the series? Enter `value_counts()`:

In [137]:
s.value_counts()

0    10
6     9
1     8
5     6
4     6
2     6
3     5
dtype: int64

<a name="ind-practice"></a>
## Independent Practice: Topic (20 minutes)
- Use the [sales.csv data set](./assets/datasets/sales_info.csv) - we've seen this a few times in previous lessons!
- Inspect the data types
- You've found out that all your values in column 1 are off by 1, add 1 to column 1 of the dataset
- Use .value_counts to count the values of 1 column of the dataset

**Bonus**
- Add 3 to column 2
- Use .value_counts for each column of the dataset